Reports/бит_ЗадолжникиПоДомуОбъявленияНаПодъезды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ЗадолжникиПоДомуОбъявленияНаПодъезды</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ЗависимыеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗависимыеЛС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчетЗависимый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/бит_ЗадолжникиПоДомуОбъявленияНаПодъезды/Forms/Форма/Ext/Form/Module.bsl
Процедура ЗаменитьНаЧисловуюКолонку(ТАблицаЗначений, ИмяКолонки)  
	МасивКолонки = ТАблицаЗначений.ВыгрузитьКолонку(ИмяКолонки);   
	ТАблицаЗначений.Колонки.Удалить(ТАблицаЗначений.Колонки.Найти(ИмяКолонки));
	ТАблицаЗначений.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));  
	ТАблицаЗначений.ЗагрузитьКолонку(МасивКолонки, ИмяКолонки);
КонецПроцедуры  

&НаСервере
Функция СформироватьНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	
	ТабДок.ПолеСверху = 2;
	ТабДок.ПолеСлева = 2;
	ТабДок.ПолеСправа = 2;
	ТабДок.ПолеСнизу = 2;
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("МакетЗадолжникиПоДому");
	
	ОбластьШапкаТипыУслуг = Макет.ПолучитьОбласть("ШапкаТипыУслуг");
	ОбластьШапкаАдресПериод = Макет.ПолучитьОбласть("ШапкаАдресПериод");
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	
	Если ПоказыватьЗадолженностьПоКапРемонту Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Иначе
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаБезКапРемонта");
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьОбъявление = Макет.ПолучитьОбласть("Объявление");
	ОбластьТелефонДляСправок = Макет.ПолучитьОбласть("ТелефонДляСправок");
	СтрокаЗаголовок = "";
		
	Если ЗначениеЗаполнено(УслугаГруппаУслуг) Тогда

		
		Для Каждого Услуга ИЗ УслугаГруппаУслуг Цикл
			
			СтрокаЗаголовок = СтрокаЗаголовок + Услуга.Значение + "; ";
			 
		КонецЦикла;
		
		Если ПоказыватьЗадолженностьПоКапРемонту Тогда
			СтрокаЗаголовок = СтрокаЗаголовок + КапРемонтГруппаУслуг + "; ";
		КонецЕсли;
		
		
	Иначе
		
		СтрокаЗаголовок = " все услуги";
		
	КонецЕсли;
	
	ОбластьШапкаТЧ.Параметры.Период = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy" );	
	Если ПоказыватьЗадолженностьПоКапРемонту Тогда
		ОбластьШапкаТЧ.Параметры.СтрокаКапРемонт = "Кап. ремонт > " + КоличествоМесяцевЗадолженностиПоКапРемонту  + " мес.";
	КонецЕсли;

	Данные = ПолучитьДанные();
	ЗаменитьНаЧисловуюКолонку(Данные, "ПодъездНаименование"); 
	//ТабДок.Вывести(ОбластьШапкаТипыУслуг);     
	Данные.Сортировать("Здание, ПодъездНаименование,НомеКвартиры");
	Подъезд = Неопределено;	
	Здание = Неопределено;
	ПерваяИтерация = Истина;
	
	Для Каждого СтрокаД Из Данные Цикл
		ПоказыватьЗадолженность = ?(ПоказыватьЗадолженностьПоКапРемонту, СтрокаД.ЗадолженностьКапРемонт > 0 ИЛИ СтрокаД.ЗадолженностьОДН > 0, СтрокаД.ЗадолженностьОДН > 0); 
		
		Если НЕ ПоказыватьЗадолженность ТОгда
			Продолжить;
		КонецЕсли;		
		
		Если ПоПодъездам И НЕ Подъезд = СтрокаД.Подъезд Тогда 
			 Если Не ПерваяИтерация Тогда
				ТабДок.Вывести(ОбластьПодвал);
				
				ТабДок.Вывести(ОбластьОбъявление);
				ОбластьТелефонДляСправок.Параметры.ТелефонДляСправок = СтрокаД.ТелефонДляСправок;
				ТабДок.Вывести(ОбластьТелефонДляСправок);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

			Иначе
				
				ОбластьОбъявление.Параметры.Объявление = Объявление;

			КонецЕсли;
			
			ПерваяИтерация = Ложь;
			
			ОбластьШапкаАдресПериод.Параметры.АдресДома = "" + СтрокаД.Здание + " подъезд " + СтрокаД.Подъезд;
			
			ТабДок.Вывести(ОбластьШапкаТипыУслуг);
			ТабДок.Вывести(ОбластьШапкаАдресПериод);
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			Подъезд = СтрокаД.Подъезд;
			Здание = СтрокаД.Здание;	

		ИначеЕсли НЕ Здание = СтрокаД.Здание Тогда
			Если Не ПерваяИтерация Тогда
				ТабДок.Вывести(ОбластьПодвал);
				
				ТабДок.Вывести(ОбластьОбъявление);
				ОбластьТелефонДляСправок.Параметры.ТелефонДляСправок = СтрокаД.ТелефонДляСправок;
				ТабДок.Вывести(ОбластьТелефонДляСправок);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

			Иначе
				
				ОбластьОбъявление.Параметры.Объявление = Объявление;

			КонецЕсли;
			
			ПерваяИтерация = Ложь;
			
			ОбластьШапкаАдресПериод.Параметры.АдресДома = СтрокаД.Здание;
			ТабДок.Вывести(ОбластьШапкаТипыУслуг);
			ТабДок.Вывести(ОбластьШапкаАдресПериод);
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			Подъезд = СтрокаД.Подъезд;
			Здание = СтрокаД.Здание;	
						
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Квартира = СтрокаД.Квартира;
		Если СтрокаД.ЗадолженностьКапРемонт >= 0
			И ПоказыватьЗадолженностьПоКапРемонту 
			ТОГДА 
			ОбластьСтрока.Параметры.СуммаКапРемонт = СтрокаД.ЗадолженностьКапРемонт;
		КонецЕсли;
	
		ОбластьСтрока.Параметры.СуммаОДН =  ?(СтрокаД.ЗадолженностьОДН>0, СтрокаД.ЗадолженностьОДН, 0);
				
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Если НЕ (ПерваяИтерация) ТОгда
		
		ТабДок.Вывести(ОбластьПодвал);
		ТабДок.Вывести(ОбластьОбъявление);
		ОбластьТелефонДляСправок.Параметры.ТелефонДляСправок = СтрокаД.ТелефонДляСправок;
		ТабДок.Вывести(ОбластьТелефонДляСправок);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если (ЗначениеЗаполнено(Адрес) Или (ЗначениеЗаполнено(Участок) И УчастокПодходит(Участок))) 
	И ЗначениеЗаполнено(Период) Тогда
		ТаблиичныйДокументРез = СформироватьНаСервере();
		ТаблиичныйДокументРез.Показать();
	Иначе
	 	Сообщить("Для формирования отчета необходимо установить отбор на период. И либо отбор на адрес, либо на подходящий участок");
	КонецЕсли;

КонецПроцедуры

Функция ЗависимыеЛС(ЛицевыеСчета)
	ЗапросАрхивные = Новый Запрос;
	ЗапросАрхивные.Текст = "ВЫБРАТЬ
	                       |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	                       |ИЗ
	                       |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	                       |ГДЕ
	                       |	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)
	                       |	И НЕ бит_ЛицевыеСчета.Архивный";
	
	ЗапросАрхивные.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	
	ЛСНА = ЗапросАрхивные.Выполнить().выгрузить();
	ЛСНА = ЛСНА.Скопировать(, "Ссылка");
	
	ЗапросЗависимыеЛС = Новый Запрос;
	ЗапросЗависимыеЛС.Текст = "ВЫБРАТЬ
	                          |	бит_ЗависимыеЛС.ЛицевойСчетЗависимый КАК ЛицевойСчетЗависимый
	                          |ИЗ
	                          |	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	                          |ГДЕ
	                          |	бит_ЗависимыеЛС.ЛицевойСчет В(&ЛицевыеСчета)
	                          |	И НЕ бит_ЗависимыеЛС.ЛицевойСчетЗависимый.Архивный";
	
	ЗапросЗависимыеЛС.УстановитьПараметр("ЛицевыеСчета", ЛСНА);
	 
	ВыборкаЗависимыеЛС = ЗапросЗависимыеЛС.Выполнить().Выбрать();
	
	ЛСРезультат = Новый Массив;
	
	Для Каждого ЛС Из ЛСНА Цикл
		ЛСРезультат.Добавить(ЛС);	
	КонецЦикла;
	 
	Пока ВыборкаЗависимыеЛС.Следующий() Цикл
		
		ЛСРезультат.Добавить(ВыборкаЗависимыеЛС.ЛицевойСчетЗависимый);
		
	КонецЦикла;
	
	Возврат ЛСРезультат; 
	
КонецФункции

Функция ПолучитьДанные()
	
	Адреса = Новый Массив;
	Если ЗначениеЗаполнено(Адрес) Тогда
		
		Адреса.Добавить(Адрес);
	
	КонецЕсли;
	
	Если УчастокПодходит(Участок) Тогда
		ЗапросЗданияПоУчастку = Новый Запрос;
		ЗапросЗданияПоУчастку.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	бит_СписокЗданий.Ссылка КАК Ссылка
	                              |ИЗ
	                              |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	                              |ГДЕ
	                              |	бит_СписокЗданий.Участок В(&Участки)";
		ЗапросЗданияПоУчастку.УстановитьПараметр("Участки", Участок);
	
		ВыборкаЗдания = ЗапросЗданияПоУчастку.Выполнить().Выбрать();
	
		Пока ВыборкаЗдания.Следующий() Цикл
		
			Адреса.Добавить(ВыборкаЗдания.Ссылка);
		
		КонецЦикла;
	КонецЕсли;

	УслугиПараметр = Новый Массив;
	
	Для Каждого Услуга ИЗ УслугаГруппаУслуг Цикл
		
		УслугиПараметр.Добавить(Услуга.Значение);
		
	КонецЦикла;
	
	УслугиПараметр.Добавить(КапРемонтГруппаУслуг);

	ЗапросУслуги = Новый Запрос;
	ЗапросУслуги.Текст = "ВЫБРАТЬ
	                     |	бит_УслугиЖКХ.Ссылка КАК Ссылка
	                     |ИЗ
	                     |	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	                     |ГДЕ
	                     |	(бит_УслугиЖКХ.Ссылка В (&Услуги)
	                     |			ИЛИ бит_УслугиЖКХ.ГруппаУслуги В (&Услуги))";
	
	ЗапросУслуги.УстановитьПараметр("Услуги", УслугиПараметр);
	
	ВыборкаУслуги = ЗапросУслуги.Выполнить().Выбрать();
	
	Услуги = Новый Массив;
	
	Пока ВыборкаУслуги.Следующий() Цикл
		Услуги.Добавить(ВыборкаУслуги.Ссылка);		
	КонецЦикла;
	
	ТипыПомещенийМ = Новый Массив;
	
	Для Каждого Тип Из ТипыПомещений Цикл
		
		ТипыПомещенийМ.Добавить(Тип.Значение);
		
	КонецЦикла;
	
	ЗапросЛицевыеСчета = Новый Запрос;
	ЗапросЛицевыеСчета.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                           |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет
	                           |ИЗ
	                           |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &ОкончаниеПериода, Месяц, , ЛицевойСчет.Здание В (&Адреса)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	                           |ГДЕ
	                           |		ВЫБОР
	                           |			КОГДА &УслугиЗаполнены > 0
	                           |				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ В(&Услуги)
	                           |			ИНАЧЕ ИСТИНА
	                           |		КОНЕЦ";
	ЗапросЛицевыеСчета.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	ЗапросЛицевыеСчета.УстановитьПараметр("ОкончаниеПериода", Период.ДатаОкончания);
	ЗапросЛицевыеСчета.УстановитьПараметр("Услуги", Услуги);
	ЗапросЛицевыеСчета.УстановитьПараметр("УслугиЗаполнены", Услуги.Количество());
	ЗАпросЛицевыеСчета.УстановитьПараметр("Адреса", Адреса);
	
	ВыборкаЛицевыеСчета = ЗапросЛицевыеСчета.Выполнить().Выбрать();
	
	ЛС = Новый Массив;
	
	Пока ВыборкаЛицевыеСчета.Следующий() Цикл
		
		ЛС.Добавить(ВыборкаЛицевыеСчета.ЛицевойСчет);
		
	КонецЦикла;
	
	РежимПотребленияНеНачислять = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Не начислять");
	ТипКвартирыМуниципальная = Справочники.бит_СтатусыКвартиры.НайтиПоНаименованию("Муниципальная");

	ВсеЛС = ЗависимыеЛС(ЛС);
	ОсновнойЗапрос = Новый Запрос;
	ОсновнойЗапрос.Текст = "ВЫБРАТЬ
	                       |	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ, 0) КАК УслугаЖКХ,
	                       |	ВЫБОР
	                       |		КОГДА &ОкончаниеПериода <= &ТекДата
	                       |			ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток, 0)
	                       |		ИНАЧЕ ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток, 0)
	                       |	КОНЕЦ КАК СуммаКонечныйОстаток,
	                       |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	                       |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет.Квартира КАК ЛицевойСчетКвартира,
	                       |	ВЫБОР
	                       |		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.ГруппаУслуги = &ГруппаКапРемонт
	                       |			ТОГДА ""КапРемонт""
	                       |		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.ГруппаУслуги = &ГруппаОДН
	                       |			ТОГДА ""ОДН""
	                       |	КОНЕЦ КАК ГруппаУслуг,
	                       |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет
	                       |ПОМЕСТИТЬ ВТ_КоличествоМесяцевЗадолженности
	                       |ИЗ
	                       |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	                       |			&НачалоПериода,
	                       |			&ОкончаниеПериода,
	                       |			,
	                       |			,
	                       |			ЛицевойСчет В (&ЛицевыеСчета)
	                       |				И ВЫБОР
	                       |					КОГДА &УслугиЗаполнены > 0
	                       |						ТОГДА УслугаЖКХ В (&Услуги)
	                       |					ИНАЧЕ ИСТИНА
	                       |				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	                       |				&ТекДата,
	                       |				ЛицевойСчет В (&ЛицевыеСчета)
	                       |					И ВЫБОР
	                       |						КОГДА &УслугиЗаполнены > 0
	                       |							ТОГДА УслугаЖКХ В (&Услуги)
	                       |						ИНАЧЕ ИСТИНА
	                       |					КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОстатки
	                       |		ПО бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет = бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет
	                       |			И (бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ)
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчет,
	                       |	бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК УслугаЖКХ,
	                       |	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХ.Сумма, 0)) КАК Сумма
	                       |ПОМЕСТИТЬ ВТ_ПоложительныеРазовые
	                       |ИЗ
	                       |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ КАК бит_НачисленияПоУслугамЖКХ
	                       |ГДЕ
	                       |	бит_НачисленияПоУслугамЖКХ.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	                       |	И бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	                       |	И бит_НачисленияПоУслугамЖКХ.ЛицевойСчет В(&ЛицевыеСчета)
	                       |	И бит_НачисленияПоУслугамЖКХ.Сумма > 0
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет,
	                       |	бит_НачисленияПоУслугамЖКХ.УслугаЖКХ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫБОР
	                       |		КОГДА &ОкончаниеПериода <= &ТекДата
	                       |			ТОГДА ЕСТЬNULL(ВТ_КоличествоМесяцевЗадолженности.СуммаКонечныйОстаток, 0) - (ЕСТЬNULL(ВТ_КоличествоМесяцевЗадолженности.СуммаПриход, 0) + ЕСТЬNULL(ВТ_ПоложительныеРазовые.Сумма, 0))
	                       |		ИНАЧЕ ЕСТЬNULL(ВТ_КоличествоМесяцевЗадолженности.СуммаКонечныйОстаток, 0)
	                       |	КОНЕЦ КАК СуммаЗадолженности,
	                       |	ВТ_КоличествоМесяцевЗадолженности.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_КоличествоМесяцевЗадолженности.ЛицевойСчетКвартира КАК ЛицевойСчетКвартира,
	                       |	ВТ_КоличествоМесяцевЗадолженности.ГруппаУслуг КАК ГруппаУслуг,
	                       |	ЕСТЬNULL(ВТ_ПоложительныеРазовые.Сумма, 0) КАК РазовыеСумма,
	                       |	ВТ_КоличествоМесяцевЗадолженности.СуммаПриход КАК Начисления,
	                       |	ВТ_КоличествоМесяцевЗадолженности.СуммаКонечныйОстаток КАК КМ,
	                       |	ВТ_КоличествоМесяцевЗадолженности.ЛицевойСчет.Здание КАК Здание,
	                       |	ВТ_КоличествоМесяцевЗадолженности.ЛицевойСчетКвартира.Подъезд КАК Подъезд,
	                       |	ВТ_КоличествоМесяцевЗадолженности.УслугаЖКХ КАК УслугаЖКХ,
	                       |	ВТ_КоличествоМесяцевЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_СуммаЗадолженности
	                       |ИЗ
	                       |	ВТ_КоличествоМесяцевЗадолженности КАК ВТ_КоличествоМесяцевЗадолженности
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоложительныеРазовые КАК ВТ_ПоложительныеРазовые
	                       |		ПО ВТ_КоличествоМесяцевЗадолженности.УслугаЖКХ = ВТ_ПоложительныеРазовые.УслугаЖКХ
	                       |			И ВТ_КоличествоМесяцевЗадолженности.ЛицевойСчет = ВТ_ПоложительныеРазовые.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СУММА(ВТ_СуммаЗадолженности.СуммаЗадолженности) КАК СуммаЗадолженности,
	                       |	ВТ_СуммаЗадолженности.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_СуммаЗадолженности.ГруппаУслуг КАК ГруппаУслуг,
	                       |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	                       |	ВТ_СуммаЗадолженности.Здание КАК Здание,
	                       |	ВТ_СуммаЗадолженности.Подъезд КАК Подъезд,
	                       |	ВТ_СуммаЗадолженности.Здание.Участок.ТелефоныУчастка КАК ТелефонДляСправок,
	                       |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК Квартира,
	                       |	бит_СведенияОКвартиреСрезПоследних.Квартира.НомерКвартиры КАК НомерКвартиры,
	                       |	СУММА(ВТ_СуммаЗадолженности.Начисления) КАК Начисления,
	                       |	СУММА(ВТ_СуммаЗадолженности.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_ОДН
	                       |ИЗ
	                       |	ВТ_СуммаЗадолженности КАК ВТ_СуммаЗадолженности
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ОкончаниеПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	                       |		ПО ВТ_СуммаЗадолженности.ЛицевойСчетКвартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	                       |ГДЕ
	                       |	ВЫБОР
	                       |			КОГДА &ТипКвартирыЗаполнено > 0
	                       |				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры В (&ТипыКвартир)
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |	И ВТ_СуммаЗадолженности.ГруппаУслуг = ""ОДН""
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВТ_СуммаЗадолженности.ГруппаУслуг,
	                       |	ВТ_СуммаЗадолженности.ЛицевойСчет,
	                       |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	                       |	ВТ_СуммаЗадолженности.Здание,
	                       |	ВТ_СуммаЗадолженности.Подъезд,
	                       |	ВТ_СуммаЗадолженности.Здание.Участок.ТелефоныУчастка,
	                       |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры,
	                       |	бит_СведенияОКвартиреСрезПоследних.Квартира.НомерКвартиры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СУММА(ВТ_СуммаЗадолженности.СуммаЗадолженности) КАК СуммаЗадолженности,
	                       |	ВТ_СуммаЗадолженности.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_СуммаЗадолженности.ГруппаУслуг КАК ГруппаУслуг,
	                       |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	                       |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	                       |	ВТ_СуммаЗадолженности.Здание КАК Здание,
	                       |	ВТ_СуммаЗадолженности.Подъезд КАК Подъезд,
	                       |	ВТ_СуммаЗадолженности.Здание.Участок.ТелефоныУчастка КАК ТелефонДляСправок,
	                       |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК Квартира,
	                       |	бит_СведенияОКвартиреСрезПоследних.Квартира.НомерКвартиры КАК НомерКвартиры,
	                       |	СУММА(ВТ_СуммаЗадолженности.Начисления) КАК Начисления,
	                       |	СУММА(ВТ_СуммаЗадолженности.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_КапРемонт
	                       |ИЗ
	                       |	ВТ_СуммаЗадолженности КАК ВТ_СуммаЗадолженности
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ОкончаниеПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	                       |		ПО ВТ_СуммаЗадолженности.ЛицевойСчетКвартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	                       |ГДЕ
	                       |	ВЫБОР
	                       |			КОГДА &ТипКвартирыЗаполнено > 0
	                       |				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры В (&ТипыКвартир)
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |	И ВТ_СуммаЗадолженности.ГруппаУслуг = ""КапРемонт""
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВТ_СуммаЗадолженности.ГруппаУслуг,
	                       |	ВТ_СуммаЗадолженности.ЛицевойСчет,
	                       |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	                       |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	                       |	ВТ_СуммаЗадолженности.Здание,
	                       |	ВТ_СуммаЗадолженности.Подъезд,
	                       |	ВТ_СуммаЗадолженности.Здание.Участок.ТелефоныУчастка,
	                       |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры,
	                       |	бит_СведенияОКвартиреСрезПоследних.Квартира.НомерКвартиры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	                       |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	                       |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	                       |ПОМЕСТИТЬ ВТ_РежимыПотребления
	                       |ИЗ
	                       |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	                       |			&ОкончаниеПериода,
	                       |			ЛицевойСчет В (&ЛицевыеСчета)
	                       |				И Услуга.ГруппаУслуги = &ГруппаКапРЕмонт) КАК бит_СведенияПоУслугамЛССрезПоследних
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_КапРемонт.СуммаЗадолженности КАК СуммаЗадолженности,
	                       |	ВТ_КапРемонт.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_КапРемонт.ГруппаУслуг КАК ГруппаУслуг,
	                       |	ВТ_КапРемонт.ТипКвартиры КАК ТипКвартиры,
	                       |	ВТ_КапРемонт.Здание КАК Здание,
	                       |	ВТ_КапРемонт.Подъезд КАК Подъезд,
	                       |	ВТ_КапРемонт.ТелефонДляСправок КАК ТелефонДляСправок,
	                       |	ВТ_КапРемонт.Квартира КАК Квартира,
	                       |	ВТ_КапРемонт.НомерКвартиры КАК НомерКвартиры,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_КапРемонт.СуммаКонечныйОстаток <> 0
	                       |				И ВТ_КапРемонт.Начисления <> 0
	                       |			ТОГДА ВЫРАЗИТЬ(ВТ_КапРемонт.СуммаКонечныйОстаток / ВТ_КапРемонт.Начисления КАК ЧИСЛО(15, 0))
	                       |		ИНАЧЕ 0
	                       |	КОНЕЦ КАК КоличествоМесяцевЗадолженности,
	                       |	ВТ_КапРемонт.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_КапРемонтИтог
	                       |ИЗ
	                       |	ВТ_КапРемонт КАК ВТ_КапРемонт
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РежимыПотребления КАК ВТ_РежимыПотребления
	                       |		ПО ВТ_КапРемонт.ЛицевойСчет.Ссылка = ВТ_РежимыПотребления.ЛицевойСчет.Ссылка
	                       |ГДЕ
	                       |	НЕ ВТ_КапРемонт.СтатусКвартиры = &ТипКвартирыМуниципальная
	                       |	И ВЫБОР
	                       |			КОГДА ВТ_РежимыПотребления.РежимПотребления ССЫЛКА Справочник.бит_РежимыПотребленияУслуг
	                       |				ТОГДА НЕ ВТ_РежимыПотребления.РежимПотребления = &РежимПотребленияНеНачислять
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_ОДН.СуммаЗадолженности КАК СуммаЗадолженности,
	                       |	ВТ_ОДН.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_ОДН.ГруппаУслуг КАК ГруппаУслуг,
	                       |	ВТ_ОДН.ТипКвартиры КАК ТипКвартиры,
	                       |	ВТ_ОДН.Здание КАК Здание,
	                       |	ВТ_ОДН.Подъезд КАК Подъезд,
	                       |	ВТ_ОДН.ТелефонДляСправок КАК ТелефонДляСправок,
	                       |	ВТ_ОДН.Квартира КАК Квартира,
	                       |	ВТ_ОДН.НомерКвартиры КАК НомерКвартиры,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДН.СуммаКонечныйОстаток <> 0
	                       |				И ВТ_ОДН.Начисления <> 0
	                       |			ТОГДА ВЫРАЗИТЬ(ВТ_ОДН.СуммаКонечныйОстаток / ВТ_ОДН.Начисления КАК ЧИСЛО(15, 0))
	                       |		ИНАЧЕ 0
	                       |	КОНЕЦ КАК КоличествоМесяцев,
	                       |	ВТ_ОДН.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_ОДНИтог
	                       |ИЗ
	                       |	ВТ_ОДН КАК ВТ_ОДН
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНИтог.КоличествоМесяцев >= &КоличествоМесяцевЗадолженностиОДН
	                       |			ТОГДА ВТ_ОДНИтог.СуммаЗадолженности
	                       |		ИНАЧЕ 0
	                       |	КОНЕЦ КАК СуммаЗадолженности,
	                       |	ВТ_ОДНИтог.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_ОДНИтог.ГруппаУслуг КАК ГруппаУслуг,
	                       |	ВТ_ОДНИтог.ТипКвартиры КАК ТипКвартиры,
	                       |	ВТ_ОДНИтог.Здание КАК Здание,
	                       |	ВТ_ОДНИтог.Подъезд КАК Подъезд,
	                       |	ВТ_ОДНИтог.ТелефонДляСправок КАК ТелефонДляСправок,
	                       |	ВТ_ОДНИтог.Квартира КАК Квартира,
	                       |	ВТ_ОДНИтог.НомерКвартиры КАК НомерКвартиры,
	                       |	ВТ_ОДНИтог.КоличествоМесяцев КАК КоличествоМесяцев,
	                       |	ВТ_ОДНИтог.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_ОДНКоличествоМесяцев
	                       |ИЗ
	                       |	ВТ_ОДНИтог КАК ВТ_ОДНИтог
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_КапРемонтИтог.СуммаЗадолженности КАК СуммаЗадолженности,
	                       |	ВТ_КапРемонтИтог.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_КапРемонтИтог.ГруппаУслуг КАК ГруппаУслуг,
	                       |	ВТ_КапРемонтИтог.ТипКвартиры КАК ТипКвартиры,
	                       |	ВТ_КапРемонтИтог.Здание КАК Здание,
	                       |	ВТ_КапРемонтИтог.Подъезд КАК Подъезд,
	                       |	ВТ_КапРемонтИтог.ТелефонДляСправок КАК ТелефонДляСправок,
	                       |	ВТ_КапРемонтИтог.Квартира КАК Квартира,
	                       |	ВТ_КапРемонтИтог.НомерКвартиры КАК НомерКвартиры,
	                       |	ВТ_КапРемонтИтог.КоличествоМесяцевЗадолженности КАК КоличествоМесяцевЗадолженности
	                       |ПОМЕСТИТЬ ВТ_КапРемонтОтборКоличествоМесяцев
	                       |ИЗ
	                       |	ВТ_КапРемонтИтог КАК ВТ_КапРемонтИтог
	                       |ГДЕ
	                       |	ВТ_КапРемонтИтог.КоличествоМесяцевЗадолженности >= &КоличествоМесяцевЗадолженностиКапРемонт
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_ОДНИтог.ЛицевойСчет КАК ОсновнойЛицевойСчет,
	                       |	бит_ЗависимыеЛС.ЛицевойСчетЗависимый КАК ЗависимыйЛицевойСчет,
	                       |	ВТ_ОДНИтог.Здание КАК Здание,
	                       |	ВТ_ОДНИтог.Подъезд КАК Подъезд,
	                       |	ВТ_ОДНИтог.ТелефонДляСправок КАК ТелефонДляСправок,
	                       |	ВТ_ОДНИтог.Квартира КАК Квартира,
	                       |	ВТ_ОДНИтог.СуммаЗадолженности КАК СуммаЗадолженности,
	                       |	ВТ_ОДНИтог.НомерКвартиры КАК НомерКвартиры
	                       |ПОМЕСТИТЬ ВТ_ЗависимыеЛСОДН
	                       |ИЗ
	                       |	ВТ_ОДНИтог КАК ВТ_ОДНИтог
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	                       |		ПО ВТ_ОДНИтог.ЛицевойСчет = бит_ЗависимыеЛС.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	бит_ЗависимыеЛС.ЛицевойСчетЗависимый КАК ЗависимыйЛицевойСчет,
	                       |	ВТ_КапРемонтИтог.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_КапРемонтИтог.Здание КАК Здание,
	                       |	ВТ_КапРемонтИтог.Подъезд КАК Подъезд,
	                       |	ВТ_КапРемонтИтог.ТелефонДляСправок КАК ТелефонДляСправок,
	                       |	ВТ_КапРемонтИтог.Квартира КАК Квартира,
	                       |	ВТ_КапРемонтИтог.СуммаЗадолженности КАК СуммаЗадолженности,
	                       |	ВТ_КапРемонтИтог.НомерКвартиры КАК НомерКвартиры
	                       |ПОМЕСТИТЬ ВТ_ЗависимыеЛСКапРемонт
	                       |ИЗ
	                       |	ВТ_КапРемонтИтог КАК ВТ_КапРемонтИтог
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	                       |		ПО ВТ_КапРемонтИтог.ЛицевойСчет = бит_ЗависимыеЛС.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СУММА(ЕСТЬNULL(ВТ_КапРемонтОтборКоличествоМесяцев.СуммаЗадолженности, 0)) КАК ЗадолженностьКапРемонт,
	                       |	СУММА(ЕСТЬNULL(ВТ_ОДНКоличествоМесяцев.СуммаЗадолженности, 0)) КАК ЗадолженностьОДН,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Здание
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Здание
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Здание
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Здание
	                       |				КОНЕЦ
	                       |	КОНЕЦ КАК Здание,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Подъезд
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Подъезд
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Подъезд
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Подъезд
	                       |				КОНЕЦ
	                       |	КОНЕЦ КАК Подъезд,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Квартира
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Квартира
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Квартира
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Квартира
	                       |				КОНЕЦ
	                       |	КОНЕЦ КАК Квартира,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.ТелефонДляСправок
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.ТелефонДляСправок
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.ТелефонДляСправок
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.ТелефонДляСправок
	                       |				КОНЕЦ
	                       |	КОНЕЦ КАК ТелефонДляСправок,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.НомерКвартиры
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.НомерКвартиры
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.НомерКвартиры
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.НомерКвартиры
	                       |				КОНЕЦ
	                       |	КОНЕЦ КАК НомеКвартиры,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Подъезд.Наименование
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Подъезд.Наименование
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Подъезд.Наименование
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Подъезд.Наименование
	                       |				КОНЕЦ
	                       |	КОНЕЦ КАК ПодъездНаименование
	                       |ИЗ
	                       |	ВТ_ОДНКоличествоМесяцев КАК ВТ_ОДНКоличествоМесяцев
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КапРемонтОтборКоличествоМесяцев КАК ВТ_КапРемонтОтборКоличествоМесяцев
	                       |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗависимыеЛСКапРемонт КАК ВТ_ЗависимыеЛСКапРемонт
	                       |			ПО ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет = ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет
	                       |		ПО ВТ_ОДНКоличествоМесяцев.ЛицевойСчет = ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет
	                       |			И ВТ_ОДНКоличествоМесяцев.Подъезд = ВТ_КапРемонтОтборКоличествоМесяцев.Подъезд
	                       |			И ВТ_ОДНКоличествоМесяцев.Здание = ВТ_КапРемонтОтборКоличествоМесяцев.Здание
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗависимыеЛСОДН КАК ВТ_ЗависимыеЛСОДН
	                       |		ПО ВТ_ОДНКоличествоМесяцев.ЛицевойСчет = ВТ_ЗависимыеЛСОДН.ЗависимыйЛицевойСчет
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Здание
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Здание
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Здание
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Здание
	                       |				КОНЕЦ
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Квартира
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Квартира
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Квартира
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Квартира
	                       |				КОНЕЦ
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.ТелефонДляСправок
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.ТелефонДляСправок
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.ТелефонДляСправок
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.ТелефонДляСправок
	                       |				КОНЕЦ
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.НомерКвартиры
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.НомерКвартиры
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.НомерКвартиры
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.НомерКвартиры
	                       |				КОНЕЦ
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Подъезд
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Подъезд
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Подъезд
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Подъезд
	                       |				КОНЕЦ
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ОДНКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСОДН.ОсновнойЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСОДН.Подъезд.Наименование
	                       |					ИНАЧЕ ВТ_ОДНКоличествоМесяцев.Подъезд.Наименование
	                       |				КОНЕЦ
	                       |		КОГДА ВТ_КапРемонтОтборКоличествоМесяцев.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВЫБОР
	                       |					КОГДА ВТ_ЗависимыеЛСКапРемонт.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |						ТОГДА ВТ_ЗависимыеЛСКапРемонт.Подъезд.Наименование
	                       |					ИНАЧЕ ВТ_КапРемонтОтборКоличествоМесяцев.Подъезд.Наименование
	                       |				КОНЕЦ
	                       |	КОНЕЦ
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	Здание,
	                       |	Подъезд,
	                       |	НомеКвартиры";
	
	ОсновнойЗапрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	ОсновнойЗапрос.УстановитьПараметр("ОкончаниеПериода", Период.ДатаОкончания);
	ОсновнойЗапрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	ОсновнойЗапрос.УстановитьПараметр("ЛицевыеСчета", ВсеЛС);
	ОсновнойЗапрос.УстановитьПараметр("УслугиЗаполнены", Услуги.Количество());
	ОсновнойЗапрос.УстановитьПараметр("Услуги", Услуги);
	ОсновнойЗапрос.УстановитьПараметр("ТипыКвартир", ТипыПомещенийМ);
	ОсновнойЗапрос.УстановитьПараметр("ТипКвартирыЗаполнено", ТипыПомещенийМ.Количество());
	ОсновнойЗапрос.УстановитьПараметр("КоличествоМесяцевЗадолженностиОДН", КоличествоМесяцевЗадолженностиСодержаниеЖилья);
	ОсновнойЗапрос.УстановитьПараметр("КоличествоМесяцевЗадолженностиКапРемонт", КоличествоМесяцевЗадолженностиПоКапРемонту);
	ОсновнойЗапрос.УстановитьПараметр("ГруппаКапРемонт", КапРемонтГруппаУслуг );
	ОсновнойЗапрос.УстановитьПараметр("ГруппаОДН",  СодержаниеИРемонтГруппаУслуг);
	ОсновнойЗапрос.УстановитьПараметр("ТипКвартирыМуниципальная",ТипКвартирыМуниципальная );
	ОсновнойЗапрос.УстановитьПараметр("РежимПотребленияНеНачислять", РежимПотребленияНеНачислять);
	
	РезультатЗапроса = ОсновнойЗапрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПредставлениеМесяца(НомерМесяца)
	
	Месяца = Новый Соответствие;
	Месяца.Вставить(1, "Январь");
	Месяца.Вставить(2, "Февраль");
	Месяца.Вставить(3, "Март");
	Месяца.Вставить(4, "Апрель");
	Месяца.Вставить(5, "Май");
	Месяца.Вставить(6, "Июнь");
	Месяца.Вставить(7, "Июль");
	Месяца.Вставить(8, "Август");
	Месяца.Вставить(9, "Сентябрь");
	Месяца.Вставить(10, "Октябрь");
	Месяца.Вставить(11, "Ноябрь");
	Месяца.Вставить(12, "Декабрь");
	
	Возврат  Месяца.Получить(НомерМесяца);
	
КонецФункции

Функция УчастокПодходит(Участок)
	
	Если грв_СтрокаВЧисло(Участок.Наименование) >= 100 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция грв_СтрокаВЧисло(Знач СтрокаЧисло) Экспорт
 
 ЧислоРез = "";
 Для Индекс = 1 По СтрДлина(СтрокаЧисло) Цикл
  Символ = Сред(СтрокаЧисло, Индекс, 1);
  КодСимвола = КодСимвола(Символ);
  Если ((КодСимвола >= 48 И КодСимвола <= 57) Или (Символ = "-" И Индекс = 1) Или (Символ = ",") Или (Символ = ".") Или (Символ = " ") Или (КодСимвола = 160)) Тогда
   Если КодСимвола <> 32 И КодСимвола <> 160 Тогда
    ЧислоРез = ЧислоРез + Символ;
   КонецЕсли; 
  Иначе
   Прервать;
  КонецЕсли;
 КонецЦикла;
 
 ЧислоРез = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧислоРез);
 
 Возврат ЧислоРез;
 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объявление = "Уважаемые жители!"
	"Напоминаем, что оплата за содержание жилья и КРСОИ (ОДН) должна производиться до 10го числа месяца,"
	+ " следующего за расчетным. Просьба в кратчайшие сроки погасить имеющуюся задолженность, а также не задерживать текущие платежи.";
	
	КоличествоМесяцевЗадолженностиПоКапРемонту = 6;
	КоличествоМесяцевЗадолженностиСодержаниеЖилья = 2;
	
	СодержаниеИРемонтГруппаУслуг = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000001");
	КапРемонтГруппаУслуг 		 = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Капитальный ремонт");
	
	УслугаГруппаУслуг.Добавить(СодержаниеИРемонтГруппаУслуг);
	
	//shevtsov 24.02.26 Начало
	ИнициализироватьЭлементы();
	//shevtsov 24.02.26 Окончание
	
КонецПроцедуры

//shevtsov 24.02.26 Начало

&НаСервере
Процедура ИнициализироватьЭлементы()
	
	ГруппаВыгрузка = ЭтаФорма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"));
	ГруппаВыгрузка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВыгрузка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаВыгрузка.ОтображатьЗаголовок = ЛОЖЬ;
	ГруппаВыгрузка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.Переместить(ГруппаВыгрузка, ЭтаФорма, Элементы.Объявление);
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("Каталог",Новый ОписаниеТипов("Строка",,));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Каталог", Тип("ПолеФормы"), ГруппаВыгрузка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.ПутьКДанным = "Каталог";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "КаталогНачалоВыбора");
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("СохранитьВФайлы");
	НоваяКоманда.Заголовок = "Сохранить в файлы";
	НоваяКоманда.Действие = "СохранитьВФайлы";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СохранитьВФайлы", Тип("КнопкаФормы"), ГруппаВыгрузка);
	НовыйЭлемент.Заголовок = "Сохранить в файлы";
	НовыйЭлемент.ИмяКоманды = "СохранитьВФайлы";
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = ЭтаФорма.Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмя(С)
	
	Рез = С;
	Рез = СтрЗаменить(Рез, "\", "");
	Рез = СтрЗаменить(Рез, "/", "");
	Рез = СтрЗаменить(Рез, ":", "");
	Рез = СтрЗаменить(Рез, "*", "");
	Рез = СтрЗаменить(Рез, "?", "");
	Рез = СтрЗаменить(Рез, """", "");
	Рез = СтрЗаменить(Рез, "<", "");
	Рез = СтрЗаменить(Рез, ">", "");
	Рез = СтрЗаменить(Рез, "|", "");
	Рез = СтрЗаменить(Рез, "+", "");
	
	Имя = СокрЛП(Рез);
	
	Возврат Имя;
	
КонецФункции

&НаКлиенте
Процедура СохранитьВФайлы(Команда)
	
	Если ЗначениеЗаполнено(Период) Тогда
		
		ПолучитьТабличныеДокументыПоАдресам();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Файлы сформированы.'");
		Сообщение.Сообщить();
		
	Иначе
		
	 	Сообщить("Для формирования отчета необходимо установить отбор на период. И либо отбор на адрес, либо на подходящий участок");
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабличныеДокументыПоАдресам()
	
	КаталогСохранения = СтрШаблон("%1\%2-%3", ЭтаФорма.Каталог, Формат(Период.ДатаНачала, "ДФ=yyyyMMdd"), Формат(Период.ДатаОкончания, "ДФ=yyyyMMdd"));
	УчастокВПамяти = Участок;
	АдресВПамяти = Адрес;
	Участок = Справочники.бит_ТехническиеУчастки.ПустаяСсылка();
	Адрес = Справочники.бит_СписокЗданий.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ТехническиеУчастки.Ссылка КАК Участок,
	               |	бит_СписокЗданий.Ссылка КАК Здание,
				   |	бит_СписокЗданий.Код КАК КодЗдания
	               |ИЗ
	               |	Справочник.бит_ТехническиеУчастки КАК бит_ТехническиеУчастки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	               |		ПО бит_ТехническиеУчастки.Ссылка = бит_СписокЗданий.Участок
	               |ГДЕ
	               |	бит_ТехническиеУчастки.Наименование ПОДОБНО ""[0-9][0-9][0-9]""
				   |	И #УсловиеУчасток
				   |	И #УсловиеЗдание
	               |ИТОГИ ПО
	               |	Участок";
				   
	Если ЗначениеЗаполнено(УчастокВПамяти) И УчастокПодходит(УчастокВПамяти) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеУчасток", "бит_ТехническиеУчастки.Ссылка В (&Участки)");
		Запрос.УстановитьПараметр("Участки", УчастокВПамяти);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеУчасток", "ИСТИНА");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресВПамяти) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗдание", "бит_СписокЗданий.Ссылка В (&Адреса)");
		Запрос.УстановитьПараметр("Адреса", АдресВПамяти);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗдание", "ИСТИНА");
		
	КонецЕсли;
	
	ВыборкаПоУчасткам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоУчасткам.Следующий() Цикл
		
		КаталогСохраненияУчасток = СтрШаблон("%1\%2", КаталогСохранения, Строка(ВыборкаПоУчасткам.Участок));
		Выборка = ВыборкаПоУчасткам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СоздатьКаталог(КаталогСохраненияУчасток);
		
		Пока Выборка.Следующий() Цикл
			
			Адрес = Выборка.Здание;
			ТабличныйДокумент = СформироватьНаСервере();
			Если Не ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
				
				Путь = СтрШаблон("%1\%2.pdf", КаталогСохраненияУчасток, ПолучитьИмя(Выборка.КодЗдания));
				ТабличныйДокумент.Записать(Путь, ТипФайлаТабличногоДокумента.PDF);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Участок = УчастокВПамяти;
	Адрес = АдресВПамяти;
	
КонецПроцедуры

//shevtsov 24.02.26 Окончание
